# Напишите программу, которая считывает одну строку, \
# после чего выводит «YES», если в введенной строке \
# есть подстрока «синий» и «NO» в противном случае.
text_line = input()
if 'синий' in text_line:
    print('YES')
else:
    print('NO')
